<template>
  <q-card-section>
    <div class="text-h5 q-mt-sm q-mb-xs">Установка приложения WireGuard</div>
    <div class="text-caption">
      <ol>
        <li>
          Откройте магазин приложений macOS и найдите приложение WireGuard.
        </li>
        <li>
          Нажмите Получить/Установить, чтобы загрузить и установить приложение.
        </li>
        <li>
          Запустите приложение WireGuard из панели запуска или папки приложения
          на вашем компьютере.
        </li>
        <li>
          Значок WireGuard будет отображаться в верхней строке меню вашего
          рабочего стола (ни одно окно не откроется автоматически).
        </li>
      </ol>
    </div>
  </q-card-section>
  <q-card-section>
    <div class="text-h5 q-mt-sm q-mb-xs">Импортируйте файл конфигурации</div>
    <div class="text-caption">
      <ol>
        <li>
          Щелкните значок WireGuard, расположенный в верхней строке меню
          рабочего стола.
        </li>
        <li>В раскрывающемся меню выберите Импортировать туннели из файла…</li>
        <li>
          Перейдите в папку, в которой хранятся файлы конфигурации VPN, и
          выберите файл конфигурации, который вы хотите импортировать.
        </li>
        <li>Щелкните Импорт.</li>
        <li>
          Нажмите «Разрешить», если появится всплывающее окно с сообщением
          «WireGuard хочет добавить конфигурации VPN».
        </li>
      </ol>
    </div>
  </q-card-section>
  <q-card-section>
    <div class="text-h5 q-mt-sm q-mb-xs">Включить VPN</div>
    <div class="text-caption">
      <ol>
        <li>
          Щелкните значок WireGuard, расположенный в верхней строке меню
          рабочего стола.
        </li>
        <li>
          В выпадающем меню выберите VPN-подключение, к которому вы хотите
          подключиться.
        </li>
      </ol>
    </div>
  </q-card-section>
  <q-card-section>
    <div class="text-h5 q-mt-sm q-mb-xs">Отключить VPN</div>
    <div class="text-caption">
      <ol>
        <li>
          Щелкните значок WireGuard, расположенный в верхней строке меню
          рабочего стола.
        </li>
        <li>
          В раскрывающемся меню нажмите на сервер, к которому вы подключены
          (тот, рядом с которым стоит галочка).
        </li>
        <li>Галочка исчезнет, сигнализируя об отключении.</li>
      </ol>
    </div>
  </q-card-section>
  <q-card-section>
    <div class="text-h5 q-mt-sm q-mb-xs">Изменить соединение</div>
    <div class="text-caption">
      <ol>
        <li>
          Щелкните значок WireGuard, расположенный в верхней строке меню
          рабочего стола.
        </li>
        <li>В раскрывающемся меню нажмите «Управление туннелями».</li>
        <li>
          Нажмите на туннель (подключение VPN), который вы хотите изменить.
        </li>
        <li>
          Нажмите кнопку редактирования. Вам будет предложено подтвердить пароль
          вашего компьютера.
        </li>
        <li>Внесите изменения в название туннеля.</li>
      </ol>
    </div>
  </q-card-section>
  <q-card-section>
    <div class="text-h5 q-mt-sm q-mb-xs">Активация по требованию</div>
    <div class="text-caption">
      <ol>
        <li>
          Включите этот параметр, если вы сталкиваетесь с частыми отключениями
          или хотите, чтобы служба VPN всегда была активна.
        </li>
        <li>
          Щелкните значок WireGuard, расположенный в верхней строке меню
          рабочего стола.
        </li>
        <li>В раскрывающемся меню нажмите «Управление туннелями».</li>
        <li>
          Нажмите на туннель (подключение VPN), который вы хотите изменить.
        </li>
        <li>
          Нажмите кнопку редактирования. Вам будет предложено подтвердить пароль
          вашего компьютера.
        </li>
        <li>Включите сотовую связь или Wi-Fi или оба.</li>
      </ol>
    </div>
  </q-card-section>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "MacosManual",
  setup() {},
});
</script>

<style lang="scss"></style>
